Repository: wch/r-source
Catalog: src/library/grid/po/R-*.po
Languages: pt_br

source: Invalid 'at' location in 'axis'
pt_br: Localização 'at' inválida em 'axis'

source: Invalid to specify axis labels when 'at' is NULL
pt_br: Inválido especificar rótulos de eixos quanto 'at' é NULL

source: 'labels' and 'at' locations must have same length
pt_br: localizações de 'labels' e 'at' devem ter o mesmo comprimento

source: logical 'label' supplied on length 0
pt_br: 'label' lógica fornecida com comprimento 0

source: End points must not be identical
pt_br: Pontos finais não devem ser identicos

source: 'x1', 'y1', 'x2', and 'y2' must be units
pt_br: 'x1', 'y1' ,'x2', e 'y2' devem ser unidade

source: 'shape' must be between -1 and 1
pt_br: 'shape' deve ser entre -1 e 1

source: 'squareShape' must be between -1 and 1
pt_br: 'squareShape' deve ser entre -1 e 1

source: 'arrow' must be an arrow object or NULL
pt_br: 'arrow' deve ser um objeto 'arrow' ou NULL

source: How did we get here?
pt_br: Como é que chegamos aqui?

source: Must start new page if showing leaves separately
pt_br: Deve iniciar nova página se folhas estão exibidas separadamente

source: Invalid 'edit' information
pt_br: informação 'edit' inválida

source: 'gEditList' can only contain 'gEdit' objects
pt_br: 'gEditList' pode conter apenas objetos 'gEdit'

source: Invalid 'frame'
pt_br: 'frame' inválido

source: Invalid 'grob'
pt_br: 'grob' inválido

source: Invalid 'row' and/or 'col' (no such cell in frame layout)
pt_br: 'row' e/ou 'col' (nenhuma célula na estrutura de dados)

source: 'col' can only be a range of existing columns
pt_br: 'col' só pode ser um intervalo de colunas existentes

source: Invalid 'col' specification
pt_br: Especificação inválida para 'col'

source: 'row' can only be a range of existing rows
pt_br: 'row' só pode ser um intervalo de linhas existentes

source: Invalid 'row' specification
pt_br: Especificação inválida para 'row'

source: Cannot specify more than one of 'side=["left", "right"]', 'col', 'col.before', or 'col.after'
pt_br: Não pode ser especificado mais de um 'side=["left", "right"]', 'col', 'col.before', ou 'col.after'

source: Must specify exactly one of 'side=["top", "bottom"]', 'row', 'row.before', or 'row.after'
pt_br: Deve especificar exatamente um de 'side=["top", "bottom"]', 'row', 'row.before', ou 'row.after'

source: Invalid 'n'
pt_br: 'n' inválido

source: Invalid 'f'
pt_br: 'f' inválido

source: gpar element '%s' must not be length 0
pt_br: elemento gpar '%s' não deve ser de comprimento 0

source: 'gamma' gpar is defunct
pt_br: 'gamma' gpar é extinto

source: Invalid 'linemitre' value
pt_br: Valor 'linemitre' inválido

source: Invalid 'alpha' value
pt_br: Valor 'alpha' inválido

source: Must specify only one of 'font' and 'fontface'
pt_br: Deve especificar somente um de 'font' e 'fontface'

source: Invalid font face
pt_br: Superfície da fonte inválida

source: Argument must be a 'gpar' object
pt_br: Argumento deve ser um objeto 'gpar'

source: Must specify only valid 'gpar' names
pt_br: Deve especificar apenas nomes 'gpar' válidos

source: Invalid display list element
pt_br: elemento da lista de exibição inválido

source: grob(s) overwritten (grab WILL not be faithful; try 'wrap=TRUE')
pt_br: grob(s) sobrescrito(s) (captura NÃO será fiel; tente 'wrap=TRUE')

source: viewport overwritten (grab MAY not be faithful)
pt_br: Vista sobrescrita (captura PODE não ser fiel)

source: grob pushed viewports and did not pop/up them (grab MAY not be faithful)
pt_br: grob modificou a ordem e a mesma não foi restaurada (captura PODE não ser fiel)

source: Only valid to push viewports
pt_br: Somente válido para empurrar vistas

source: Must specify at least one viewport
pt_br: Deve especificar ao menos uma vista

source: Must pop at least one viewport
pt_br: Deve restaurar ao menos uma vista

source: Must navigate up at least one viewport
pt_br: Deve ao menos navegar até uma vista

source: The vp argument is deprecated
pt_br: O argumento "vp" é obsoleto

source: Invalid 'ask' value
pt_br: Valor 'ask' incorreto

source: Invalid object inserted on the display list
pt_br: Objeto inválido inserido na lista de exibição

source: Invalid 'grob' argument
pt_br: Argumento 'grob' inválido

source: Invalid 'vp' slot
pt_br: Slot 'vp' Inválido

source: Invalid 'gp' slot
pt_br: Slot 'gp' inválido

source: Invalid 'grob' class
pt_br: Classe 'grob' inválida

source: grid.grob() is deprecated; please use grob() instead
pt_br: grid.grob() é obsoleta; ao invés disso, use grob()

source: A 'grob' path must contain at least one 'grob' name
pt_br: Um caminho 'grob' deve conter ao menos um nome 'grob'

source: Invalid 'grob' name(s)
pt_br: Nome(s) de 'grob' inválido(s)

source: Unable to coerce to gList
pt_br: Impossível converter automaticamente em uma gList

source: Only 'grobs' allowed in 'gList'
pt_br: Somente 'grobs' permitidos em 'gList'

source: Invalid element to add to 'gList'
pt_br: elemento inválido para adicionar à 'gList'

source: Can only set 'children' for a 'gTree'
pt_br: Só é permitido definir 'children' para uma 'gTree'

source: 'children' must be a 'gList'
pt_br: 'children' deve ser uma 'gList'

source: It is only valid to get 'children' from a 'gTree'
pt_br: Só é válido obter 'children' de uma 'gTree'

source: Invalid 'gTree' class
pt_br: Classe 'gTree' inválida

source: 'allDevices' not yet implemented
pt_br: 'allDevices' não foram implementados ainda

source: Invalid 'gPath'
pt_br: 'gPath' inválido

source: Invalid 'grep' value
pt_br: Valor 'grep' inválido

source: It is only valid to get a child from a 'gTree'
pt_br: Só é válido obter um 'child' de uma 'gTree'

source: 'gPath' does not specify a valid child
pt_br: 'gPath' não especifica uma criança válida

source: It is only valid to set a child of a 'gTree'
pt_br: Somente é válido definir uma criança de uma 'gTree'

source: It is only valid to set a 'grob' as child of a 'gTree'
pt_br: Somente é válido definir um 'grob' como criança de um 'gTree'

source: New 'grob' name (%s) does not match 'gPath' (%s)
pt_br: Novo nome de 'grob' (%s) não corresponde a 'gPath' (%s)

source: It is only valid to add a 'grob' to a 'gTree'
pt_br: Somente é válido adicionar um 'grob' a um 'gTree'

source: It is only valid to add a child to a 'gTree'
pt_br: Somente é válido adicionar um filho a um 'gTree'

source: 'gPath' (%s) not found
pt_br: 'gPath' (%s) não encontrado

source: It is only valid to remove a child from a 'gTree'
pt_br: Somente é válido remover um filho de um 'gTree'

source: It is only valid to edit a child of a 'gTree'
pt_br: Somente é válido editar um filho de um 'gTree'

source: It is invalid to directly edit the 'children' or 'childrenOrder' slot
pt_br: É inválido editar diretamente os slots 'children' ou 'childrenOrder'

source: Invalid 'result'
pt_br: 'result' inválido

source: The new 'grob' must have the same name as the old 'grob'
pt_br: O novo 'grob' deve ter o mesmo nome do 'grob' antigo

source: Slot '%s' not found
pt_br: Slot '%s' não encontrado

source: gPath (%s) not found
pt_br: gPath (%s) não encontrado

source: Grob '%s' not found
pt_br: Grob '%s' não encontrado

source: Invalid element in the display list
pt_br: Elemento Inválido na lista de exibição

source: This function is redundant and will disappear in future versions.
pt_br: Esta função é redundante e não aparecerá em versões futuras.

source: 'l' must be a layout
pt_br: 'l' deve ser um layout

source: 'pch' and 'labels' not the same length
pt_br: 'pch' e 'labels' não são do mesmo tamanho

source: 'hgap' must be single unit
pt_br: 'hgap' deve ser uma única unidade

source: 'vgap' must be single unit
pt_br: 'vgap' deve ser uma única unidade

source: Invalid justification
pt_br: Justificação inválida

source: Invalid horizontal justification
pt_br: Justificação horizontal inválida

source: Invalid vertical justification
pt_br: Justificação vertical inválida

source: 'respect' must be logical or an 'nrow' by 'ncol' matrix
pt_br: 'respect' deve ser lógico ou um 'nrow' por uma matriz 'ncol'

source: Invalid 'print' argument
pt_br: argumento 'print' inválido

source: Invalid object in listing
pt_br: Objeto inválido em listing

source: Invalid listing
pt_br: listing inválido

source: Invalid 'origin'
pt_br: 'origin' inválido

source: 'length' must be a unit object
pt_br: 'length' deve ser um objeto unitário

source: Invalid 'ends' or 'type' argument
pt_br: argumento 'ends' ou 'type' inválido

source: 'x' and 'y' must be units
pt_br: 'x' e 'y' devem ser unidades

source: 'x' and 'y' must have length 1
pt_br: 'x' e 'y' devem ter comprimento 1

source: invalid 'arrow' argument
pt_br: argumento 'arrow' inválido

source: It is invalid to specify both 'id' and 'id.lengths'
pt_br: É inválido especificar 'id' e 'id.lengths' juntos

source: 'x' and 'y' must be same length
pt_br: 'x' e 'y' devem ter o mesmo comprimento

source: 'x' and 'y' and 'id' must all be same length
pt_br: 'x' e 'y' e 'id' devem ter o mesmo comprimento

source: 'x' and 'y' and 'id.lengths' must specify same overall length
pt_br: 'x' e 'y' e 'id.lengths' devem especificar o mesmo comprimento geral

source: 'x0', 'y0', 'x1', and 'y1' must be units
pt_br: 'x0', 'y0' ,'x1', e 'y1' devem ser unidades

source: 'x' and 'y' must be units or NULL
pt_br: 'x' e 'y' devem ser unidades ou NULL

source: Corrupt 'arrows' object
pt_br: Objeto 'arrows' corrupto

source: grid.arrows() has been deprecated; use 'arrow' arguments to line drawing functions.
pt_br: grid.arrows() tem sido depreciado; use argumentos 'arrow' para funções de desenho de linha

source: The 'grob' argument must be a 'line.to', 'lines', or 'segments' grob
pt_br: O argumento 'grob' deve ser 'line.to', 'lines', ou 'segments' grob

source: x and y must be units
pt_br: x e y devem ser unidades

source: shape must be between -1 and 1
pt_br: shape deve ser entre -1 e 1

source: 'x', 'y', and 'r' must be units
pt_br: 'x', 'y', e 'r' devem ser unidades

source: 'x', 'y', 'width', and 'height' must be units
pt_br: 'x', 'y', 'width', e 'height' devem ser unidades

source: Invalid 'rot' value
pt_br: Valor 'rot' Inválido

source: zero-length 'pch'
pt_br: 'pch' com comprimento-zero

source: 'x', 'y' and 'size' must be units
pt_br: 'x', 'y' e 'size' devem ser unidades

source: 'x' and 'y' must be unit objects and have the same length
pt_br: 'x' e 'y' devem ser objetos unitários e devem ter os mesmos comprimentos

source: 'x', 'y', 'width', and 'height' must all be units of length 1
pt_br: 'x', 'y', 'width', e 'height' devem ser todos unidades de comprimento 1'x', 'y', 'width', e 'height' devem ser todos unidades de comprimento 1

source: 'x' and 'y' must all be units of length 1
pt_br: 'x' e 'y' devem ser todos unidades de comprimento 1

source: 'r' must be a unit object
pt_br: 'r' deve ser um objeto unitário

source: 'x', 'y', 'width', and 'height' must have length 1
pt_br: 'x', 'y', 'width', e 'height' devem ter comprimento 1

source: 'x' and 'units' must have length > 0
pt_br: 'x' e 'units' devem ter comprimentos > 0

source: 'x' argument must be a unit object
pt_br: argumento 'x' deve ser um objeto unitário

source: Invalid 'axis' or 'type'
pt_br: 'axis' ou 'type' inválido

source: No string supplied for 'strwidth/height' unit
pt_br: Nenhuma cadeia fornecida para unidade 'strwidth/height'

source: No 'grob' supplied for 'grobwidth/height' unit
pt_br: Nenhum 'grob' fornecido para unidade 'grobwidth/height'

source: 'gPath' must have depth 1 in 'grobwidth/height' units
pt_br: 'gPath' deve ter profundidade 1 em unidades 'grobwidth/height'

source: Non-NULL value supplied for plain unit
pt_br: Valor não-NULL fornecido para unidade simples

source: Operator '%s' not meaningful for units
pt_br: Operador '%s' não faz sentido para unidades

source: Only one operand may be a unit
pt_br: Somente um operando pode ser uma unidade

source: Non-unit operand must be numeric
pt_br: Operando não-unitário deve ser numérico

source: Both operands must be units
pt_br: Ambos os operandos devem ser unidades

source: 'Summary' function '%s' not meaningful for units
pt_br: função 'Summary' '%s' não faz sentido para unidades

source: Zero arguments where at least one expected
pt_br: Nenhum argumento onde pelo menos um é esperado

source: Cannot mix signs of indices
pt_br: Não é possível mesclar os sinais dos índices

source: Index out of bounds (unit subsetting)
pt_br: Índice fora dos limites (subsetting unitário)

source: Index out of bounds (unit arithmetic subsetting)
pt_br: Índice fora dos limites (subsetting aritmético unitário)

source: Index out of bounds (unit list subsetting)
pt_br: Índice fora dos limites (tentando fazer subset de lista unitária)

source: It is invalid to combine unit objects with other types
pt_br: É inválido combinar objetos unitários com outros tipos

source: Invalid unit object
pt_br: Objeto unitário inválido

source: unit.rep has been deprecated in favour of a unit method for the generic rep function
pt_br: unit.rep tem sido depreciado em preferência ao método unitário para a função genérica rep

source: unit.length has been deprecated in favour of a unit method for the generic length function
pt_br: unit.length tem sido depreciado em preferência ao método unitário para a função genérica length

source: Invalid theta
pt_br: theta inválido

source: 'range' must be numeric
pt_br: 'range' deve ser numérico

source: Invalid graphics parameters
pt_br: Parâmetros gráficos inválidos

source: Invalid 'clip' value
pt_br: Valor 'clip' inválido

source: Invalid 'xscale' in viewport
pt_br: 'xscale' inválido em vista

source: Invalid 'yscale' in viewport
pt_br: 'yscale' inválido em vista

source: Invalid 'angle' in viewport
pt_br: 'angle' inválido em vista

source: Invalid 'layout' in viewport
pt_br: 'layout' inválido em vista

source: Invalid 'layout.pos.row' in viewport
pt_br: 'layout.pos.row' inválido em vista

source: Invalid 'layout.pos.col' in viewport
pt_br: 'layout.pos.col' inválido em vista

source: Only viewports allowed in 'vpList'
pt_br: Somente vistas permitidas em 'vpList'

source: Only viewports allowed in 'vpStack'
pt_br: Somente vistas permitidas em 'vpStack'

source: 'parent' must be a viewport and 'children' must be a 'vpList' in 'vpTree'
pt_br: 'parent' deve ser uma vista e 'children' deve ser uma 'vpList' em 'vpTree'

source: A viewport path must contain at least one viewport name
pt_br: Um caminho vista deve conter pelo menos um nome de vista

source: Invalid viewport name(s)
pt_br: Nome(s) de vista inválido(s)

source: Must specify at least one of 'x' or 'xscale'
pt_br: Deve especificar pelo menos um de 'x' ou 'xscale'

source: Must specify at least one of 'y' or 'yscale'
pt_br: Deve especificar pelo menos um de 'y' ou 'yscale'
