Repository: wch/r-source
Catalog: src/library/*/po/RGui-*.po
Languages: lt

source: Not enough memory
lt: Nepakanka atminties

source: Insufficient memory: text not copied to the clipboard
lt: Nepakanka atminties: tekstas nenukopijuotas á iðkarpinæ

source: Unable to open the clipboard
lt: Neámanoma atidaryti iðkarpinës

source: Insufficient memory. Please close the console
lt: Nepakanka atminties. Uþdarykite konsolæ

source: Font %s-%d-%d not found. Using system fixed font
lt: Ðriftas %s-%d-%d nerastas. Fiksuoto sistemos ðrifto naudojimas

source: Save selection to
lt: Áraðyti pasirinkimà á

source: Save console contents to
lt: Áraðyti konsolës turiná á

source: Scrolling.
lt: Slinkimas.

source: Keyboard: PgUp, PgDown, Ctrl+Arrows, Ctrl+Home, Ctrl+End,
lt: Klaviatûra: PgUp, PgDown, Ctrl+rodyklës, Ctrl+Home, Ctrl+End,

source: Mouse: use the scrollbar(s).
lt: Pelë: naudokite slinkties juostà (-as).

source: Editing.
lt: Redagavimas.

source: Moving the cursor:
lt: Þymeklio perkëlimas:

source: Left arrow or Ctrl+B: move backward one character;
lt: Rodyklë kairën arba Ctrl+B: judëti atgal per vienà simbolá;

source: Right arrow or Ctrl+F: move forward one character;
lt: Rodyklë deðinën arba Ctrl+F: judëti á prieká per vienà simbolá;

source: Home or Ctrl+A: go to beginning of line;
lt: Home arba Ctrl+A: eiti á eilutës pradþià;

source: End or Ctrl+E: go to end of line;
lt: End arba Ctrl+E: eiti á eilutës pabaigà;

source: History: Up and Down Arrows, Ctrl+P, Ctrl+N
lt: Istorija: rodyklës aukðtyn ir þemyn, Ctrl+P, Ctrl+N

source: Deleting:
lt: Ðalinimas:

source: Del or Ctrl+D: delete current character or selection;
lt: Del arba Ctrl+D: naikinti dabartiná simbolá arba pasirinkimà;

source: Backspace: delete preceding character;
lt: Backspace: iðtrinti ankstesná simbolá;

source: Ctrl+Del or Ctrl+K: delete text from current character to end of line.
lt: Ctrl+Del arba Ctrl+K: ðalinti tekstà nuo dabartinio simbolio iki eilutës pabaigos.

source: Ctrl+U: delete all text from current line.
lt: Ctrl+U: iðtrinti visà tekstà ið dabartinës eilutës.

source: Copy and paste.
lt: Kopijuoti ir áklijuoti.

source: Use the mouse (with the left button held down) to mark (select) text.
lt: Norëdami paþymëti tekstà naudokite pelæ (laikyti kairájá mygtukà).

source: Use Shift+Del (or Ctrl+C) to copy the marked text to the clipboard and
lt: Naudoti Shift+Del (arba Ctrl+C) nukipijuoti paþymëtà tekstà á iðkarpinæ ir

source: Shift+Ins (or Ctrl+V or Ctrl+Y) to paste the content of the clipboard (if any)
lt: Shift+Ins (arba Ctrl+V arba Ctrl+Y) áklijuoti iðkarpinës turiná (jei yra)

source: to the console, Ctrl+X first copy then paste
lt: á konsolæ, Ctrl+X pirmiausia nukopijuokite tada áklijuokite

source: Misc:
lt: Kita:

source: Ctrl+L: Clear the console.
lt: Ctrl+L: iðvalyti konsolæ.

source: Ctrl+O or INS: Toggle overwrite mode: initially off.
lt: Ctrl+O arba INS: perjungti perraðymo reþimà: ið pradþiø iðjungta.

source: Ctrl+T: Interchange current char with one to the left.
lt: Ctrl+T: apsikeisti dabartiná simbolá su vienu á kairæ.

source: Note: Console is updated only when some input is required.
lt: Pastaba: konsolë atnaujinama tik tada, kai reikia ávesties.

source: Use Ctrl+W to toggle this feature off/on.
lt: Naudokite Ctrl+W, kad perjungtumëte ðios funkcijos bûsenà.

source: Use ESC to stop the interpreter.
lt: Norëdami sustabdyti interpretatoriø, naudokite ESC.

source: TAB starts completion of the current word.
lt: TAB pradeda uþbaigti dabartiná þodá.

source: Standard Windows hotkeys can be used to switch to the
lt: Standartiniai Windows spartieji klaviðai gali bûti naudojami norint perjungti

source: graphics device (Ctrl+Tab or Ctrl+F6 in MDI, Alt+Tab in SDI)
lt: grafikos árenginys (Ctrl+Tab arba Ctrl+F6 (MDI), Alt+Tab (SDI))

source: R Editor
lt: R rengyklë

source: unable to open file %s for reading
lt: neámanoma atidaryti failo %s skaitymui

source: Could not read from file '%s'
lt: Nepavyko perskaityti ið failo '%s'

source: Could not save file '%s'
lt: Nepavyko áraðyti failo '%s'

source: Save script as
lt: Áraðyti scenarijø kaip

source: Open script
lt: Atverti scenarijø

source: No RGui console to paste to
lt: Nëra RGui konsolës,kurià áklijuoti á

source: R EDITOR
lt: R RENGYKLË

source: A standard text editor for editing and running R code.
lt: Standartinë teksto rengyklë, skirta R kodui redaguoti ir paleisti.

source: RUNNING COMMANDS
lt: VYKDOMOS KOMANDOS

source: To run a line or section of R code, select the code and either
lt: Norëdami vykdyti R kodo eilutæ arba sekcijà, pasirinkite kodà ir arba

source: Press Ctrl-R
lt: Spausti Ctrl-R

source: Select "Run line or selection" from the "Edit" menu
lt: Ið meniu „Redaguoti“ pasirinkite „Vykdyti eilutæ arba pasirinkimà“

source: Press the "Run line or selection" icon on the toolbar
lt: Árankiø juostoje paspauskite piktogramà „Vykdyti eilutæ arba pasirinkimà“

source: This will copy the selected commands to the console and evaluate them.
lt: Tai nukopijuos pasirinktas komandas á konsolæ ir ávertins jas.

source: If there is no selection, this will just run the current line and advance
lt: Jei pasirinkimo nëra, tai tiesiog paleis dabartinæ eilutæ ið anksto

source: the cursor by one line.
lt: þymeklis vienoje eilutëje.

source: Run line or selection
lt: Vykdyti eilutæ arba pasirinkimà

source: Undo
lt: Atðaukti

source: Cut
lt: Iðkirpti

source: Copy
lt: Kopijuoti

source: Paste
lt: Áklijuoti

source: Delete
lt: Paðalinti

source: Select all
lt: Pasirinkti visus

source: Save script
lt: Áraðyti scenarijø

source: Return focus to Console
lt: Gràþinti fokusà á konsolæ

source: Print script
lt: Spausdinti scenarijø

source: Print
lt: Spausdinti

source: File
lt: Failas

source: New script
lt: Naujas scenarijus

source: Open script...
lt: Atverti scenarijø...

source: Save
lt: Áraðyti

source: Save as...
lt: Áraðyti kaip...

source: Print...
lt: Spausdinti...

source: Close script
lt: Uþverti scenarijø

source: Edit
lt: Redaguoti

source: Clear console
lt: Iðvalyti konsolæ

source: Run all
lt: Vykdyti viskà

source: Find...
lt: Ieðkoti...

source: Replace...
lt: Pakeisti...

source: GUI preferences...
lt: GUI nuostatos...

source: Help
lt: Pagalba

source: Editor
lt: Rengyklë

source: Maximum number of editors reached
lt: Pasiektas maksimalus rengykliø skaièius

source: Unable to create editor window
lt: Neámanoma sukurti rengyklës lango

source: Untitled
lt: Be pavadinimo

source: Select file
lt: Pasirinkti failà

source: Error opening file
lt: Klaida atveriant failà

source: Insufficient memory to display file in internal pager
lt: Nepakanka atminties, kad bûtø galima rodyti failà vidiniame ieðkiklyje

source: No selection
lt: Nëra pasirinkimo

source: Paste to console
lt: Áklijuoti á konsolæ

source: Paste commands to console
lt: Áklijuoti komandas á konsolæ

source: Stay on top
lt: Likite virðuje

source: Close
lt: Uþverti

source: Save to File...
lt: Áraðyti á failà...

source: View
lt: Perþiûrëti

source: Unable to create pager window
lt: Neámanoma sukurti ieðkiklio lango

source: The overall console properties cannot be changed on a running console. Save the preferences and restart Rgui to apply them.
lt: Bendros konsolës ypatybiø keisti negalima veikianèioje konsolëje. Áraðykite nuostatas ir ið naujo paleiskite Rgui, kad jas pritaikytumëte.

source: The language for menus cannot be changed on a running console. Save the preferences and restart Rgui to apply to menus.
lt: Meniu kalbos negalima keisti veikianèioje konsolëje. Áraðykite nuostatas ir ið naujo paleiskite Rgui, kad jis bûtø taikomas meniu.

source: Changes in pager size will not apply to any open pagers
lt: Dydþio pakeitimai ieðkiklyje nebus taikomi jokiems atviriems ieðkikliams

source: Do not change pager type if any pager is open Proceed?
lt: Nekeiskite ieðkiklio tipo, jei atidarytas kuris nors ieðkiklis Tæsti?

source: Select directory for file 'Rconsole'
lt: Pasirinkite katalogà failui 'Rconsole'

source: Select 'Rconsole' file
lt: Pasirinkti 'Rconsole' failà

source: Ignored '%s' at line %d of file %s
lt: Nepaisytas '%s' (eilutëje %d) failo %s

source: Rgui Configuration Editor
lt: Rgui konfigûravimo rengyklë

source: Select file to source
lt: Pasirinkti failà á ðaltiná

source: Select image to load
lt: Pasirinkite norimà ákelti vaizdà

source: Save image in
lt: Áraðyti vaizdà á

source: Load history from
lt: Ákelti istorijà ið

source: Save history in
lt: Áraðyti istorijà

source: No text available
lt: Nëra teksto

source: Name of data frame or matrix
lt: Duomenø struktûros arba matricos pavadinimas

source: '%s' cannot be found
lt: Nepavyko rasti '%s'

source: Are you sure?
lt: Ar esate tikri?

source: Help on
lt: Pagalba

source: Search help
lt: Ieðkoti þinyno

source: Search for words in help list archives and documentation
lt: Ieðkokite þodþiø pagalbiniuose archyvuose ir dokumentuose

source: Apropos
lt: Savalaikis

source: Can only drag-and-drop .R, .RData and .rda files
lt: Galima tik nutempti .R, .RData ir .rda failai

source: Paste commands only
lt: Áklijuoti tik komandas

source: Copy and paste
lt: Kopijuoti ir áklijuoti

source: Clear window
lt: Iðvalyti langà

source: Buffered output
lt: Kaupiamasis iðvedimas

source: Packages
lt: Paketai

source: Load package...
lt: Ákelti paketà...

source: Set CRAN mirror...
lt: Nustatyti CRAN veidrodá...

source: Select repositories...
lt: Pasirinkti saugyklas...

source: Install package(s)...
lt: Diegti paketà (-us)...

source: Update packages...
lt: Naujinti paketus...

source: Install package(s) from local files...
lt: Ádiekite paketà (-us) ið vietiniø failø...

source: FAQ on R
lt: DUK apie R

source: FAQ on R for &Windows
lt: DUK apie R, skirtas Windows

source: Manuals (in PDF)
lt: Þinynai (PDF formatu)

source: R functions (text)...
lt: R funkcijos (tekstas)...

source: Html help
lt: HTML þinynas

source: Search help...
lt: Ieðkoti þinyno...

source: Apropos...
lt: Savalaikis...

source: R Project home page
lt: R Projekto pagrindinis puslapis

source: CRAN home page
lt: CRAN pagrindinis puslapis

source: About
lt: Apie

source: Cascade
lt: Pakopa

source: Tile &Horizontally
lt: Iðkloti &Horizontaliai

source: Tile &Vertically
lt: Iðkloti &Vertikaliai

source: Minimize group
lt: Minimizuoti grupæ

source: Restore group
lt: Atstatyti grupæ

source: Load workspace
lt: Ákelti darbo sritá

source: Save workspace
lt: Áraðyti darbo sritá

source: Stop current computation
lt: Stabdyti dabartiná skaièiavimà

source: Source R code...
lt: Ðaltinio R kodas...

source: Display file(s)...
lt: Rodyti failà (-us)...

source: Load Workspace...
lt: Ákelti darbo sritá...

source: Save Workspace...
lt: Áraðyti darbo sritá...

source: Load History...
lt: Ákelti Istorijà...

source: Save History...
lt: Áraðyti Istorijà...

source: Change dir...
lt: Keisti dir...

source: Exit
lt: Iðeiti

source: Copy and Paste
lt: Kopijuoti ir áklijuoti

source: Data editor...
lt: Duomenø rengyklë...

source: Toolbar
lt: Árankiø juosta

source: Statusbar
lt: Bûsenos juosta

source: Misc
lt: Kita

source: Stop current computation ESC
lt: Stabdyti dabartiná skaièiavimà ESC

source: Stop all computations
lt: Stabdyti visus skaièiavimus

source: Break to debugger
lt: Pertrauka derinimo programoje

source: Word completion
lt: Þodþio uþbaigimas

source: Filename completion
lt: Filename uþbaigimas

source: List objects
lt: Objektø sàraðas

source: Remove all objects
lt: Paðalinti visus objektus

source: List search &path
lt: Sàraðo paieðka ir kelias

source: Console
lt: Konsolë

source: 'mname' is limited to 1000 bytes
lt: 'mname' ribojimas iki 1000 baitø

source: menu %s does not exist
lt: meniu %s nerastas

source: 'menu' is limited to 500 bytes
lt: 'menu' ribojimas iki 500 baitø

source: base menu does not exist
lt: pagrindinio meniu nëra

source: failed to allocate menu
lt: nepavyko priskirti meniu

source: menu + item is limited to 1000 bytes
lt: meniu + elementas ribojamas iki 1000 baitø

source: menu does not exist
lt: meniu nerastas

source: failed to allocate char storage
lt: nepavyko priskirti simboliø saugyklos

source: failed to allocate menuitem
lt: nepavyko priskirti menuitem

source: menu not found
lt: meniu nerastas

source: menu or item does not exist
lt: meniu arba elemento nëra

source: Save workspace image?
lt: Áraðyti darbo srities vaizdà?

source: Insufficient memory: cell not copied to the clipboard
lt: Nepakanka atminties: langelis nenukopijuotas á iðkarpinæ

source: Question
lt: Klausimas

source: Change working directory to:
lt: Keisti darbiná katalogà á:

source: Unable to set '%s' as working directory
lt: Neámanoma nustatyti '%s' kaip darbinio katalogo

source: Cancel
lt: Atðaukti

source: OK
lt: Gerai

source: User
lt: Vartotojas

source: Password
lt: Slaptaþodis

source: "%s" not found
lt: "%s" nerastas

source: Arrange Icons
lt: Piktogramø iðdëstymas

source: invalid argument
lt: neteisingas argumentas

source: invalid type for value
lt: neleistinas reikðmës tipas

source: Data Editor
lt: Duomenø rengyklë

source: dataentry: internal memory problem
lt: dataentry: vidinës atminties problema

source: dataentry: internal memory error
lt: dataentry: vidinës atminties klaida

source: internal type error in dataentry
lt: vidinio tipo klaida esanti dataentry

source: dataentry: parse error on string
lt: dataentry: analizavimo klaida eilutëje

source: dataentry: expression too long
lt: dataentry: iðraiðka per ilga

source: column names cannot be blank
lt: stulpeliø pavadinimai negali bûti tuðti

source: Variable editor
lt: Kintamojo rengyklë

source: variable name
lt: kintamojo pavadinimas

source: type
lt: tipas

source: Cell width(s)
lt: Langelio plotis (-èiai)

source: Cell width
lt: Langelio plotis

source: variable
lt: kintamasis

source: Navigation. Keyboard: cursor keys move selection Tab move right, Shift+Tab moves left PgDn or Ctrl+F: move down one screenful PgUp or Ctrl+B: move up one screenful Home: move to (1,1) cell End: show last rows of last column. Mouse: left-click in a cell, use the scrollbar(s). Editing. Type in the currently hightlighted cell Double-click in a cell for an editable field Misc. Ctrl-L redraws the screen, auto-resizing the columns Ctrl-C copies selected cell Ctrl-V pastes to selected cell Right-click menu for copy, paste, autosize currently selected column
lt: Navigacija. Klaviatûra: þymeklio klaviðai perkelia pasirinkimà Tab perkelia á deðinæ, Shift+Tab perkelia á kairæ PgDn arba Ctrl+F: perkelia þemyn vienu ekranu PgUp arba Ctrl+B: perkelia vienu ekranu aukðtyn Home: perkelia á (1,1) langelá End: rodo paskutines paskutinio stulpelio eilutes. Pelë: kairiuoju pelës mygtuku spustelëkite langelá, naudokite slinkties juostà (-as). Redagavimas. Áveskite á ðiuo metu paryðkintà langelá Dukart spustelëkite langelyje, kad galëtumëte redaguoti laukà Kita. Ctrl-L perbraiþo ekranà, pakeisdamas stulpeliø dydá Ctrl-C kopijuoja paþymëtà langelá Ctrl-V áklijuoja á pasirinktà langelá Deðiniuoju pelës mygtuku spustelëkite meniu, norëdami nukopijuoti, áklijuoti, automatiðkai pakeisti pasirinktà stulpelá

source: Copy selected cell
lt: Kopijuoti paþymëtà langelá

source: Paste to selected cell
lt: Áklijuoti á pasirinktà langelá

source: Autosize column
lt: Automatinis stulpelio dydþio keitimas

source: Copy CTRL+C
lt: Kopijuoti CTRL+C

source: Paste CTRL+V
lt: Áklijuoti CTRL+V

source: Delete DEL
lt: Ðalinti DEL

source: Cell widths ...
lt: Langelio ploèiai ...

source: Data editor
lt: Duomenø rengyklë

source: Portable network graphics file
lt: Neðiojamasis tinklo grafikos failas

source: Windows bitmap file
lt: Windows rastro failas

source: TIFF file
lt: TIFF failas

source: Jpeg file
lt: JPEG failas

source: Postscript file
lt: Postskriptinis failas

source: PDF file
lt: PDF failas

source: Enhanced metafiles
lt: Iðplëstiniai metafailai

source: file path selected is too long: only 512 bytes are allowed
lt: pasirinktas failo kelias per ilgas: leidþiama naudoti tik 512 baitø

source: No plot to replace!
lt: Nëra brëþinio, kurá pakeisti!

source: Variable name
lt: Kintamojo pavadinimas

source: Variable doesn't contain any plots!
lt: Kintamajame nëra jokiø brëþiniø!

source: Name of variable to save to
lt: Kintamojo pavadinimas, kurá norite áraðyti á

source: Copy to the clipboard as a metafile
lt: Kopijuoti á iðkarpinæ kaip metafailà

source: Stop locator
lt: Stabdyti ieðkiklá

source: Stop
lt: Stabdyti

source: Continue
lt: Tæsti

source: Next
lt: Sekantis

source: Next plot
lt: Kitas brëþinys

source: Save as
lt: Áraðyti kaip

source: %s quality...
lt: %s kokybë...

source: Copy to the clipboard
lt: Kopijuoti á iðkarpinæ

source: as a Bitmap CTRL+C
lt: kaip rastras CTRL+C

source: as a Metafile CTRL+W
lt: kaip metafailas CTRL+W

source: close Device
lt: uþverti árenginá

source: History
lt: Istorija

source: Recording
lt: Áraðymas

source: Add INS
lt: Átraukti INS

source: Replace
lt: Pakeisti

source: Previous PgUp
lt: Ankstesnis PgUp

source: Next PgDown
lt: Sekantis PgDown

source: Save to variable...
lt: Áraðyti á kintamàjá...

source: Get from variable...
lt: Gauti ið kintamojo...

source: Clear history
lt: Valyti istorijà

source: Resize
lt: Keisti dydá

source: R mode
lt: R reþimas

source: Fit to window
lt: Talpinti á langà

source: Fixed size
lt: Fiksuotas dydis

source: Copy as metafile
lt: Kopijuoti kaip metafailà

source: Copy as bitmap
lt: Kopijuoti kaip rastrà

source: Save as metafile...
lt: Áraðyti kaip metafailà...

source: Save as postscript...
lt: Áraðyti kaip postskriptà...

source: Locator is active
lt: Ieðkiklis aktyvus

source: Waiting to confirm page change...
lt: Laukiama, kol bus patvirtintas puslapio keitimas...

source: Click or hit ENTER for next page
lt: Spustelëkite ENTER kitam puslapiui
